wrouwet/frdm-mcxa153-blinky/src/usb_main.c
static void I2C_Init(void)
{
    CLOCK_EnableClock(kCLOCK_GateLPI2C0);
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    RESET_ReleasePeripheralReset(kLPI2C0_RST_SHIFT_RSTn);
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);

    CLOCK_AttachClk(kFRO12M_to_LPI2C0);
    CLOCK_SetClockDiv(kCLOCK_DivLPI2C0, 1U);

    /* Enable the pins' internal pull-ups (matching NXP's own lpi2c
     * reference config for these pins). I2C needs pull-ups to work at
     * all; the internal ones are weak (~kOhm range, fine at 100 kHz) and
     * mainly matter for bench-testing this bus with nothing wired to it
     * yet -- an external target board will normally supply its own,
     * stronger pull-ups once connected. */
    const port_pin_config_t i2cPinConfig = {
        .pullSelect          = kPORT_PullUp,
        .pullValueSelect     = kPORT_LowPullResistor,
        .slewRate            = kPORT_FastSlewRate,
        .passiveFilterEnable = kPORT_PassiveFilterDisable,
        .openDrainEnable     = kPORT_OpenDrainDisable,
        .driveStrength       = kPORT_LowDriveStrength,
        .driveStrength1      = kPORT_NormalDriveStrength,
        .mux                 = kPORT_MuxAlt2,
        .inputBuffer         = kPORT_InputBufferEnable,
        .invertInput         = kPORT_InputNormal,
        .lockRegister        = kPORT_UnlockRegister,
    };
    PORT_SetPinConfig(PORT3, 27U, &i2cPinConfig);
    PORT_SetPinConfig(PORT3, 28U, &i2cPinConfig);

    lpi2c_master_config_t config;
    LPI2C_MasterGetDefaultConfig(&config);
    config.baudRate_Hz = I2C_MASTER_BAUD_HZ;
    LPI2C_MasterInit(LPI2C0, &config, I2C_MASTER_CLOCK_HZ);
}

/* This driver has no automatic bus-recovery: if a transfer times out
 * (e.g. the target device is holding SCL or SDA low mid-transaction), the
 * bus stays wedged and every subsequent transfer -- even a plain write --
 * keeps failing until something forces the lines free again. This is the
 * standard I2C recovery procedure: temporarily drive the pins as plain
 * GPIO, clock SCL up to 9 times (enough for any slave stuck mid-byte to
 * finish and release SDA), then drive a manual STOP condition, before
 * switching the pins back to LPI2C0 and reinitializing the peripheral. */
static void I2C_BusRecover(void)
{
    PORT3->PCR[27] = PORT_PCR_MUX(0U) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK; /* SCL, GPIO, pull-up */
    PORT3->PCR[28] = PORT_PCR_MUX(0U) | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK; /* SDA, GPIO, pull-up */

    GPIO3->PDDR |= (1U << 27);  /* SCL: output */
    GPIO3->PDDR &= ~(1U << 28); /* SDA: input, so we can see when it's released */
    GPIO3->PSOR = (1U << 27);   /* SCL idle high */

    for (int i = 0; i < 9; i++)
    {
        if (0U != (GPIO3->PDIR & (1U << 28)))
        {
            break; /* SDA already released */
        }
        GPIO3->PCOR = (1U << 27);
        for (volatile int d = 0; d < 200; d++)
        {
        }
        GPIO3->PSOR = (1U << 27);
        for (volatile int d = 0; d < 200; d++)
        {
        }
    }

    /* Manual STOP condition: SDA low-to-high while SCL is high. */
    GPIO3->PDDR |= (1U << 28);
    GPIO3->PCOR = (1U << 28);
    for (volatile int d = 0; d < 200; d++)
    {
    }
    GPIO3->PSOR = (1U << 27);
    for (volatile int d = 0; d < 200; d++)
    {
    }
    GPIO3->PSOR = (1U << 28);
    for (volatile int d = 0; d < 200; d++)
    {
    }
    GPIO3->PDDR &= ~(1U << 28);

    I2C_Init();
}

/* NAK is a normal "no device at this address" response and doesn't mean
 * the bus is wedged, so only run recovery for the other failure classes. */
static void i2c_recover_if_needed(status_t status)
{
    if (status != kStatus_Success && status != kStatus_LPI2C_Nak)
    {
        I2C_BusRecover();
    }
}

void USB_DeviceIsrEnable(void)
{
    uint8_t usbDeviceKhciIrq[] = USBFS_IRQS;
    uint8_t irqNumber          = usbDeviceKhciIrq[CONTROLLER_ID - kUSB_ControllerKhci0];

    NVIC_SetPriority((IRQn_Type)irqNumber, USB_DEVICE_INTERRUPT_PRIORITY);
    EnableIRQ((IRQn_Type)irqNumber);
}

/*******************************************************************************
 * UART-to-I2C command bridge
 *
 * Line-based text protocol, one command per line (LF or CRLF terminated).
 * <addr> is a 7-bit I2C address, <byte> a data byte -- both 1-2 hex
 * digits, no "0x" prefix. <n> is a decimal byte count.
 *
 *   W <addr> <byte> [byte ...]     write bytes to <addr>
 *   R <addr> <n>                   read <n> bytes from <addr>
 *   X <addr> <n> <byte> [byte ...] write bytes, repeated-start, then
 *                                  read <n> bytes (register-read pattern)
 *   S                              scan the bus, list responding addresses
 *
 * Replies (also LF/CRLF terminated):
 *   OK                             W succeeded
 *   OK <byte> [byte ...]           R/X succeeded, with the read data
 *   OK <addr> [addr ...]           S succeeded (may be empty if nothing found)
 *   ERR <reason>                   something went wrong
 *
 * Example: reading 2 bytes starting at register 0x00 of a device at 0x50:
 *   > X 50 2 00
 *   < OK a1 b2
 ******************************************************************************/
/* Keep replies within one 64-byte USB full-speed packet: "OK" + N * "
 * xx" + "\r\n" must fit, so N <= 16 leaves comfortable headroom. */
#define I2C_CMD_MAX_DATA 16U

static const char *skip_spaces(const char *p)
{
    while (*p == ' ')
    {
        p++;
    }
    return p;
}

static bool parse_hex_u32(const char **pp, uint32_t *out, uint32_t maxDigits)
{
    const char *p = skip_spaces(*pp);
    uint32_t value = 0;
    uint32_t ndig  = 0;
    while (ndig < maxDigits)
    {
        char c = *p;
        uint32_t digit;
        if (c >= '0' && c <= '9')
        {
            digit = (uint32_t)(c - '0');
        }
        else if (c >= 'a' && c <= 'f')
        {
            digit = (uint32_t)(c - 'a' + 10);
        }
        else if (c >= 'A' && c <= 'F')
        {
            digit = (uint32_t)(c - 'A' + 10);
        }
        else
        {
            break;
        }
        value = (value << 4) | digit;
        ndig++;
        p++;
    }
    if (ndig == 0U)
    {
        return false;
    }
    *out = value;
    *pp  = p;
    return true;
}

static bool parse_dec_u32(const char **pp, uint32_t *out)
{
    const char *p = skip_spaces(*pp);
    uint32_t value = 0;
    uint32_t ndig  = 0;
    while (*p >= '0' && *p <= '9')
    {
        value = (value * 10U) + (uint32_t)(*p - '0');
        p++;
        ndig++;
    }
    if (ndig == 0U)
    {
        return false;
    }
    *out = value;
    *pp  = p;
    return true;
}

static uint32_t append_str(char *buf, uint32_t pos, const char *s)
{
    while (*s)
    {
        buf[pos++] = *s++;
    }
    return pos;
}

