wrouwet/frdm-mcxa153-blinky/src/usb_main.c
static uint32_t append_hex_byte(char *buf, uint32_t pos, uint8_t v)
{
    static const char hexdigits[] = "0123456789abcdef";
    buf[pos++]                    = hexdigits[(v >> 4) & 0xFU];
    buf[pos++]                    = hexdigits[v & 0xFU];
    return pos;
}

/* I2C_RETRY_TIMES is overridden (see Makefile) to a finite value so a
 * floating/unwired bus (no target attached, no pull-ups) fails fast with
 * kStatus_LPI2C_Timeout instead of hanging the whole command loop forever. */
static const char *i2c_error_str(status_t status)
{
    switch (status)
    {
        case kStatus_LPI2C_Nak:
            return "ERR nak";
        case kStatus_LPI2C_Timeout:
            return "ERR timeout (bus never went idle -- check wiring/pull-ups)";
        case kStatus_LPI2C_PinLowTimeout:
            return "ERR pin low timeout (SCL or SDA stuck low -- check wiring/short/target power)";
        case kStatus_LPI2C_ArbitrationLost:
            return "ERR arbitration lost (bus contention -- another master, or SDA/SCL swapped/shorted?)";
        case kStatus_LPI2C_BitError:
            return "ERR bit error (bus noise or a wire not making contact)";
        case kStatus_LPI2C_FifoError:
            return "ERR fifo error";
        case kStatus_LPI2C_Busy:
            return "ERR busy";
        default:
            return "ERR i2c (unknown status)";
    }
}

/* Processes one received command line (not including its line ending) and
 * writes a reply (not including its line ending) into outBuf. Returns the
 * reply length. outBuf must be at least DATA_BUFF_SIZE bytes. */
static uint32_t process_command(const char *line, uint32_t lineLen, char *outBuf)
{
    const char *p = skip_spaces(line);
    char cmd      = *p;
    if (cmd >= 'a' && cmd <= 'z')
    {
        cmd = (char)(cmd - 'a' + 'A');
    }
    p++;

    if (cmd != 'S' && cmd != 'W' && cmd != 'R' && cmd != 'X')
    {
        return append_str(outBuf, 0, "ERR bad command");
    }

    if (cmd == 'S')
    {
        /* Probe each address with a zero-length write, the standard I2C
         * scan idiom: it's just a START + address byte + STOP, and
         * LPI2C_MasterTransferBlocking() correctly waits for and reports
         * a NAK. (The lower-level LPI2C_MasterStart() alone does *not* --
         * it only enqueues the START command into the hardware FIFO and
         * returns, without waiting to see whether the address was
         * actually acknowledged on the bus -- so it can't be used to
         * detect a NAK by itself.) */
        uint32_t pos = append_str(outBuf, 0, "OK");
        for (uint32_t addr = 0x08U; addr <= 0x77U; addr++)
        {
            lpi2c_master_transfer_t probe = {0};
            probe.slaveAddress             = (uint16_t)addr;
            probe.direction                = kLPI2C_Write;
            probe.flags                    = kLPI2C_TransferDefaultFlag;

            if (kStatus_Success == LPI2C_MasterTransferBlocking(LPI2C0, &probe))
            {
                outBuf[pos++] = ' ';
                pos           = append_hex_byte(outBuf, pos, (uint8_t)addr);
            }
        }
        return pos;
    }

    uint32_t addr;
    if (!parse_hex_u32(&p, &addr, 2U) || addr > 0x7FU)
    {
        return append_str(outBuf, 0, "ERR bad address");
    }

    if (cmd == 'W' || cmd == 'X')
    {
        uint32_t readCount = 0;
        if (cmd == 'X')
        {
            if (!parse_dec_u32(&p, &readCount) || readCount > I2C_CMD_MAX_DATA)
            {
                return append_str(outBuf, 0, "ERR bad count");
            }
        }

        uint8_t data[I2C_CMD_MAX_DATA];
        uint32_t dataLen = 0;
        uint32_t byte;
        while (dataLen < I2C_CMD_MAX_DATA && parse_hex_u32(&p, &byte, 2U))
        {
            data[dataLen++] = (uint8_t)byte;
        }

        lpi2c_master_transfer_t xfer = {0};
        xfer.slaveAddress             = (uint16_t)addr;
        xfer.direction                = kLPI2C_Write;
        xfer.data                     = data;
        xfer.dataSize                 = dataLen;
        xfer.flags                    = (cmd == 'X') ? kLPI2C_TransferNoStopFlag : kLPI2C_TransferDefaultFlag;

        status_t status = LPI2C_MasterTransferBlocking(LPI2C0, &xfer);
        if (status != kStatus_Success)
        {
            i2c_recover_if_needed(status);
            return append_str(outBuf, 0, i2c_error_str(status));
        }

        if (cmd == 'W')
        {
            return append_str(outBuf, 0, "OK");
        }

        uint8_t rdata[I2C_CMD_MAX_DATA];
        lpi2c_master_transfer_t rxfer = {0};
        rxfer.slaveAddress             = (uint16_t)addr;
        rxfer.direction                = kLPI2C_Read;
        rxfer.data                     = rdata;
        rxfer.dataSize                 = readCount;
        rxfer.flags                    = kLPI2C_TransferRepeatedStartFlag;

        status = LPI2C_MasterTransferBlocking(LPI2C0, &rxfer);
        if (status != kStatus_Success)
        {
            i2c_recover_if_needed(status);
            return append_str(outBuf, 0, i2c_error_str(status));
        }

        uint32_t pos = append_str(outBuf, 0, "OK");
        for (uint32_t i = 0; i < readCount; i++)
        {
            outBuf[pos++] = ' ';
            pos           = append_hex_byte(outBuf, pos, rdata[i]);
        }
        return pos;
    }

    if (cmd == 'R')
    {
        uint32_t count;
        if (!parse_dec_u32(&p, &count) || count > I2C_CMD_MAX_DATA)
        {
            return append_str(outBuf, 0, "ERR bad count");
        }

        uint8_t rdata[I2C_CMD_MAX_DATA];
        lpi2c_master_transfer_t xfer = {0};
        xfer.slaveAddress             = (uint16_t)addr;
        xfer.direction                = kLPI2C_Read;
        xfer.data                     = rdata;
        xfer.dataSize                 = count;
        xfer.flags                    = kLPI2C_TransferDefaultFlag;

        status_t status = LPI2C_MasterTransferBlocking(LPI2C0, &xfer);
        if (status != kStatus_Success)
        {
            i2c_recover_if_needed(status);
            return append_str(outBuf, 0, i2c_error_str(status));
        }

